<?xml version="1.0" encoding="utf-8"?>
        <feed xmlns="http://www.w3.org/2005/Atom">
        <title>吴奇灵的博客</title>
        <subtitle>欢迎来到我的博客</subtitle>
        <link href="https://www.wqlblog.cn/" rel="alternate" type="text/html"/>
        <link href="https://www.wqlblog.cn/atom.xml" rel="self" type="application/atom+xml"/>
        <id>https://www.wqlblog.cn/</id>
        <updated>2026-04-11T19:19:15.453Z</updated>
        <language>zh</language>
        <entry>
            <title>Cloudflare 加速 + GitHub Pages + 阿里云域名</title>
            <link href="https://www.wqlblog.cn/articles/Cloudflare_%E5%8A%A0%E9%80%9F_GitHub_Pages_%E9%98%BF%E9%87%8C%E4%BA%91%E5%9F%9F%E5%90%8D/" rel="alternate" type="text/html"/>
            <id>https://www.wqlblog.cn/articles/Cloudflare_%E5%8A%A0%E9%80%9F_GitHub_Pages_%E9%98%BF%E9%87%8C%E4%BA%91%E5%9F%9F%E5%90%8D/</id>
            <published>2026-04-10T00:00:00.000Z</published>
            <updated>2026-04-10T00:00:00.000Z</updated>
            <summary></summary>
            <content type="html"><![CDATA[<h1>Cloudflare 加速 + GitHub Pages + 阿里云域名</h1>
<p>参考文章：</p>
<ol>
<li><a href="https://www.cnblogs.com/yuelblog/p/15829774.html">GitHub pages+自定义域名(腾讯云域名)+cloudflare加速</a></li>
<li><a href="https://tequila.xin/2025/12/06/Github%20Pages%20%E5%9F%9F%E5%90%8D%E6%9B%B4%E6%8D%A2%20+%20%E5%9F%BA%E4%BA%8E%20Cloudflare%20%E5%8A%A0%E9%80%9F%E5%9B%BD%E5%86%85%E8%AE%BF%E9%97%AE/">Github Pages 域名更换 + 基于 Cloudflare 加速国内访问</a></li>
</ol>
<h2>一、架构与域名规划</h2>

            <link href="https://www.wqlblog.cn/articles/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF%EF%BC%8CC_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/" rel="alternate" type="text/html"/>
            <id>https://www.wqlblog.cn/articles/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF%EF%BC%8CC_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/</id>
            <published>2024-07-27T00:00:00.000Z</published>
            <updated>2024-07-27T00:00:00.000Z</updated>
            <summary></summary>
            <content type="html"><![CDATA[<h1>IDA中对于菱形继承中是否为虚继承的判断</h1>
<p>最近遇到了一种菱形继承关系的类结构，在判断C1、C2是否为虚继承C上产生了疑问，因此这里写一篇博客来分析自己的一些技巧。</p>
<p><img src="assets/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF_C_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/ida%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF.png" alt="未命名绘图.drawio" /></p>
<p>如何判断C1、C2是否是虚继承C？</p>
<p>一种比较简单的办法是通过查看<code>typeinfo for C1</code>的信息，看继承关系中是否包含<code>virtual public</code>关键字，通常情况下，如果C1是<code>public</code>虚继承C，那么这里会显示<code>virtual public</code>，但是如果没有显示<code>virtual</code>关键字，也有可能是虚继承，这时需要进一步查看函数列表。如果函数列表存在<code>non-virtual thunk to'C1::~C1</code>等以<code>non-virtual thunk</code>开头的函数，那说明C1不是虚继承关系，对于是如何判断出这个结果的，可以尝试写两个相同的菱形继承的代码，一个使用虚继承，一个不使用虚继承，然后分别编写为C++动态库，进入IDA中查看。</p>
<p>创建<code>so</code>动态库的命令。</p>
<pre><code>g++ -fPIC -o0 -shared -o libexample.so example.cpp
</code></pre>
<h1>菱形继承下的类布局</h1>
<p>最近工作中，遇到了菱形继承问题，对于一般菱形继承，一般有两种方式继承基类、一般继承、虚继承。在这两种情况下，类对象的布局是怎么样的，接下来通过两个示例来说明。</p>
<h2>一般继承下的菱形继承</h2>
<p>在这种情况下，<code>Sub</code>会存在两个Base类，也就是Base类有两个实体。（虽然不懂这样做的目的，但本着不理解，但尊重的原则，也介绍这种情况）</p>
<p><img src="assets/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF_C_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/%E4%B8%80%E8%88%AC%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF.png" alt="未命名绘图.drawio" /></p>
<pre><code>#include &lt;iostream&gt;
using namespace std;

class Base {
   public:
   int *iptr;
   char *cptr;
    virtual ~Base() = default;
};//  24 bytes

class otherA : public Base {
   public:
   char *cptr;
    otherA() = default;
}; // 32 bytes

class otherB : public Base {
   public:
    otherB() = default;
}; // 24 bytes

class Sub : public otherA, public otherB {
   public:
   int a;
    Sub() = default;
}; // 64 bytes

int main() {
    Sub sub;
    cout &lt;&lt; sizeof(Base) &lt;&lt; endl;
    cout &lt;&lt; sizeof(otherA) &lt;&lt; endl;
    cout &lt;&lt; sizeof(otherB) &lt;&lt; endl;
    cout &lt;&lt; sizeof(sub) &lt;&lt; endl;
    return 0;
}
</code></pre>
<p>使用<code>clang</code>查看类对象布局：</p>
<pre><code>clang++ -Xclang -fdump-record-layouts Untitled-1.cpp &gt; classlayout
</code></pre>
<pre><code>*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int * iptr
        16 |   char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherA
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int * iptr
        16 |     char * cptr
        24 |   char * cptr
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherB
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int * iptr
        16 |     char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class Sub
         0 |   class otherA (primary base)
         0 |     class Base (primary base)
         0 |       (Base vtable pointer)
         8 |       int * iptr
        16 |       char * cptr
        24 |     char * cptr
        32 |   class otherB (base)
        32 |     class Base (primary base)
        32 |       (Base vtable pointer)
        40 |       int * iptr
        48 |       char * cptr
        56 |   int a
           | [sizeof=64, dsize=60, align=8,
           |  nvsize=60, nvalign=8]
</code></pre>
<p>在这种继承方式下，可以看到，<code>otherA</code>重新利用了基类的虚表指针，也就是一般继承方式下，<code>otherA</code>不会生成自己的虚表指针，但是需要注意的是，可能会修改该虚表指针指向的位置，因为在<code>otherA</code>类中可能重写了基类的函数，一般情况下虚表和虚表指针的变化，参考<a href="./C++%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8%E5%BA%95%E5%B1%82%E7%BB%93%E6%9E%84.md">C++虚函数表底层结构 - 吴奇灵的博客 (wqlblog.cn)</a></p>
<p>同理<code>otherB</code>类也是这样，因此当子类<code>Sub</code>继承<code>otherA 或 otherB</code>也会遵循这种规则，即首先构造<code>otherA</code>，在构造<code>otherB</code>，而在<code>otherA</code>和<code>otherB</code>中又会首先构造<code>Base</code>，最终得到的<code>Sub</code>类对象，也会存在两个基类对象。</p>
<p>在这种情况下，如何调用<code>Base</code>类的成员呢，显然直接调用是不行的，得指明所属的类。</p>
<pre><code>Sub sub = new Sub;

sub-&gt;otherA::iptr = nullptr;
sub-&gt;otherB::iptr = nullptr;

sub-&gt;iptr = nullptr; // 错误，会产生二义性问题
</code></pre>
<blockquote>
<p>为了便于问题分析，我对类的布局调整了一下，确保字节对齐只在<code>Sub</code>类中存在，在<code>Sub</code>类中，<code>int a</code>占有8个字节单位（后面4字节作为padding）。
<code>class</code>的字节对齐原则和<code>struct</code>字节对齐原则相同，参考文章<a href="./%E4%B8%80%E6%AC%A1%E8%AE%B2%E6%B8%85%E6%A5%9A%E7%BB%93%E6%9E%84%E4%BD%93%E5%A4%A7%E5%B0%8F%E7%9A%84%E8%AE%A1%E7%AE%97.md">一次讲清楚结构体大小的计算 - 吴奇灵的博客 (wqlblog.cn)</a></p>
</blockquote>
<h2>虚继承下的菱形继承</h2>
<pre><code>#include &lt;iostream&gt;
using namespace std;

class Base {
   public:
   int *iptr;
   char *cptr;
    virtual ~Base() = default;
};//  24 bytes

class otherA :  virtual public Base {
   public:
   char *cptr;
    otherA() = default;
}; // 40 bytes

class otherB :  virtual public Base {
   public:
    otherB() = default;
}; // 32 bytes

class Sub : public otherA, public otherB {
   public:
   int a;
    Sub() = default;
}; // 56 bytes

int main() {
    Sub sub;
    cout &lt;&lt; sizeof(Base) &lt;&lt; endl;
    cout &lt;&lt; sizeof(otherA) &lt;&lt; endl;
    cout &lt;&lt; sizeof(otherB) &lt;&lt; endl;
    cout &lt;&lt; sizeof(sub) &lt;&lt; endl;
    return 0;
}
</code></pre>
<pre><code>*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int * iptr
        16 |   char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherA
         0 |   (otherA vtable pointer)
         8 |   char * cptr
        16 |   class Base (virtual base)
        16 |     (Base vtable pointer)
        24 |     int * iptr
        32 |     char * cptr
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherB
         0 |   (otherB vtable pointer)
         8 |   class Base (virtual base)
         8 |     (Base vtable pointer)
        16 |     int * iptr
        24 |     char * cptr
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Sub
         0 |   class otherA (primary base)
         0 |     (otherA vtable pointer)
         8 |     char * cptr
        16 |   class otherB (base)
        16 |     (otherB vtable pointer)
        24 |   int a
        32 |   class Base (virtual base)
        32 |     (Base vtable pointer)
        40 |     int * iptr
        48 |     char * cptr
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=28, nvalign=8]
</code></pre>
<p>可以看出<code>otherA</code>与<code>otherB</code>类中，会生成独立的虚表指针，用于指向自己的虚函数表，并没有使用基类的虚表指针。</p>
<p>而在<code>Sub</code>类的布局中，<code>otherA，otherB</code>中没有<code>Base</code>类的类布局，而是将<code>Base</code>类的类布局放到了末位，因为关键字<code> class Base (virtual base)</code>，指明了<code>Base</code>类是虚继承，因此之后根据该布局创建对象时，由于只有一个<code>Base</code>类布局，所以只会创建一个<code>Base</code>实例。</p>
<blockquote>
<p>细心的朋友可能会发现，<code>Base</code>类在类布局的末位，而不在一开始，这是为什么呢？</p>
<p>两个原因：</p>
<ul>
<li>如果放在开始，放在那个派生类的前面合适？例如有两个派生类继承<code>Base</code>类，你放在第一个类之前，还是放在第二个类之前？同时，如果在菱形继承的基础上在嵌套一层菱形继承，那么<code>Base</code>类应该放在哪里，才能确保所有的类都能访问到？</li>
<li>为了保证动态访问，虚基类实例的访问使用虚基类指针（<code>vbptr</code>）来动态访问，这种设计让类的布局更加灵活。</li>
</ul>
<p>综合上述两个条件，显然将虚基类放在对象的末位更加合适。（再创建一个新的类<code>Sub2</code>，它继承<code>Sub</code>类，在这种情况下，虚基类也会放在类布局的末位）</p>
</blockquote>
<h1>gnu下的调试结果</h1>
<p>当然呢也可以使用gcc来输出类似的类布局，不过相较于<code>clang</code>来说，没有这么直观，gcc主要突出的是虚表结构：</p>
<p>linux环境下：</p>
