<?xml version="1.0" encoding="UTF-8"?><rss version="2.0" xmlns:content="http://purl.org/rss/1.0/modules/content/"><channel><title>吴奇灵的博客</title><description>欢迎来到我的博客</description><link>https://www.wqlblog.cn/</link><language>zh</language><item><title>CLER Improving Multimodal Financial Reasoning by Cross-MLLM Error Reflection</title><link>https://www.wqlblog.cn/posts/CLER_Improving_Multimodal_Financial_Reasoning_by_Cross-MLLM_Error_Reflection/</link><guid isPermaLink="true">https://www.wqlblog.cn/posts/CLER_Improving_Multimodal_Financial_Reasoning_by_Cross-MLLM_Error_Reflection/</guid><pubDate>Tue, 14 Apr 2026 00:00:00 GMT</pubDate><content:encoded>&lt;h3&gt;P0. 基本信息&lt;/h3&gt;
&lt;p&gt;&lt;img src=&quot;assets/%E6%88%AA%E5%B1%8F2026-04-14%2018.20.34.png&quot; alt=&quot;&quot; /&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;题目：&lt;/strong&gt; CLER: Improving Multimodal Financial Reasoning by Cross-MLLM Error Reflection (CLER：通过跨多模态大模型的错误反思提升金融推理能力)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;会议/期刊：&lt;/strong&gt; AAAI-26 (The Fortieth AAAI Conference on Artificial Intelligence)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;年份：&lt;/strong&gt; 2026年 (注：按论文版权页标识为2026，即被AAAI最新录用)&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;作者：&lt;/strong&gt; Shuangyan Deng, Zhongsheng Wang, Rui Mao, Ciprian Doru Giurcaneanu, Jiamou Liu&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;单位：&lt;/strong&gt; 新西兰奥克兰大学，新加坡南洋理工大学&lt;/li&gt;
&lt;/ul&gt;
&lt;hr /&gt;
&lt;h3&gt;P1. 问题定义&lt;/h3&gt;

</content:encoded><category>杂项</category><category>硬件与装机</category><category>网络通信</category><category>硬件</category><category>高并发</category><category>C++</category><category>工程实践</category></item><item><title>IDA判断是否虚继承，C++菱形继承下的类布局</title><link>https://www.wqlblog.cn/posts/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF%EF%BC%8CC_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/</link><guid isPermaLink="true">https://www.wqlblog.cn/posts/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF%EF%BC%8CC_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/</guid><pubDate>Sat, 27 Jul 2024 00:00:00 GMT</pubDate><content:encoded>&lt;h1&gt;IDA中对于菱形继承中是否为虚继承的判断&lt;/h1&gt;
&lt;p&gt;最近遇到了一种菱形继承关系的类结构，在判断C1、C2是否为虚继承C上产生了疑问，因此这里写一篇博客来分析自己的一些技巧。&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;assets/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF_C_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/ida%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF.png&quot; alt=&quot;未命名绘图.drawio&quot; /&gt;&lt;/p&gt;
&lt;p&gt;如何判断C1、C2是否是虚继承C？&lt;/p&gt;
&lt;p&gt;一种比较简单的办法是通过查看&lt;code&gt;typeinfo for C1&lt;/code&gt;的信息，看继承关系中是否包含&lt;code&gt;virtual public&lt;/code&gt;关键字，通常情况下，如果C1是&lt;code&gt;public&lt;/code&gt;虚继承C，那么这里会显示&lt;code&gt;virtual public&lt;/code&gt;，但是如果没有显示&lt;code&gt;virtual&lt;/code&gt;关键字，也有可能是虚继承，这时需要进一步查看函数列表。如果函数列表存在&lt;code&gt;non-virtual thunk to&apos;C1::~C1&lt;/code&gt;等以&lt;code&gt;non-virtual thunk&lt;/code&gt;开头的函数，那说明C1不是虚继承关系，对于是如何判断出这个结果的，可以尝试写两个相同的菱形继承的代码，一个使用虚继承，一个不使用虚继承，然后分别编写为C++动态库，进入IDA中查看。&lt;/p&gt;
&lt;p&gt;创建&lt;code&gt;so&lt;/code&gt;动态库的命令。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;g++ -fPIC -o0 -shared -o libexample.so example.cpp
&lt;/code&gt;&lt;/pre&gt;
&lt;h1&gt;菱形继承下的类布局&lt;/h1&gt;
&lt;p&gt;最近工作中，遇到了菱形继承问题，对于一般菱形继承，一般有两种方式继承基类、一般继承、虚继承。在这两种情况下，类对象的布局是怎么样的，接下来通过两个示例来说明。&lt;/p&gt;
&lt;h2&gt;一般继承下的菱形继承&lt;/h2&gt;
&lt;p&gt;在这种情况下，&lt;code&gt;Sub&lt;/code&gt;会存在两个Base类，也就是Base类有两个实体。（虽然不懂这样做的目的，但本着不理解，但尊重的原则，也介绍这种情况）&lt;/p&gt;
&lt;p&gt;&lt;img src=&quot;assets/IDA%E5%88%A4%E6%96%AD%E6%98%AF%E5%90%A6%E8%99%9A%E7%BB%A7%E6%89%BF_C_%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E7%B1%BB%E5%B8%83%E5%B1%80/%E4%B8%80%E8%88%AC%E7%BB%A7%E6%89%BF%E4%B8%8B%E7%9A%84%E8%8F%B1%E5%BD%A2%E7%BB%A7%E6%89%BF.png&quot; alt=&quot;未命名绘图.drawio&quot; /&gt;&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;#include &amp;lt;iostream&amp;gt;
using namespace std;

class Base {
   public:
   int *iptr;
   char *cptr;
    virtual ~Base() = default;
};//  24 bytes

class otherA : public Base {
   public:
   char *cptr;
    otherA() = default;
}; // 32 bytes

class otherB : public Base {
   public:
    otherB() = default;
}; // 24 bytes

class Sub : public otherA, public otherB {
   public:
   int a;
    Sub() = default;
}; // 64 bytes

int main() {
    Sub sub;
    cout &amp;lt;&amp;lt; sizeof(Base) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(otherA) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(otherB) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(sub) &amp;lt;&amp;lt; endl;
    return 0;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;使用&lt;code&gt;clang&lt;/code&gt;查看类对象布局：&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;clang++ -Xclang -fdump-record-layouts Untitled-1.cpp &amp;gt; classlayout
&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code&gt;*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int * iptr
        16 |   char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherA
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int * iptr
        16 |     char * cptr
        24 |   char * cptr
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherB
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int * iptr
        16 |     char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class Sub
         0 |   class otherA (primary base)
         0 |     class Base (primary base)
         0 |       (Base vtable pointer)
         8 |       int * iptr
        16 |       char * cptr
        24 |     char * cptr
        32 |   class otherB (base)
        32 |     class Base (primary base)
        32 |       (Base vtable pointer)
        40 |       int * iptr
        48 |       char * cptr
        56 |   int a
           | [sizeof=64, dsize=60, align=8,
           |  nvsize=60, nvalign=8]
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;在这种继承方式下，可以看到，&lt;code&gt;otherA&lt;/code&gt;重新利用了基类的虚表指针，也就是一般继承方式下，&lt;code&gt;otherA&lt;/code&gt;不会生成自己的虚表指针，但是需要注意的是，可能会修改该虚表指针指向的位置，因为在&lt;code&gt;otherA&lt;/code&gt;类中可能重写了基类的函数，一般情况下虚表和虚表指针的变化，参考&lt;a href=&quot;./C++%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8%E5%BA%95%E5%B1%82%E7%BB%93%E6%9E%84.md&quot;&gt;C++虚函数表底层结构&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;同理&lt;code&gt;otherB&lt;/code&gt;类也是这样，因此当子类&lt;code&gt;Sub&lt;/code&gt;继承&lt;code&gt;otherA 或 otherB&lt;/code&gt;也会遵循这种规则，即首先构造&lt;code&gt;otherA&lt;/code&gt;，在构造&lt;code&gt;otherB&lt;/code&gt;，而在&lt;code&gt;otherA&lt;/code&gt;和&lt;code&gt;otherB&lt;/code&gt;中又会首先构造&lt;code&gt;Base&lt;/code&gt;，最终得到的&lt;code&gt;Sub&lt;/code&gt;类对象，也会存在两个基类对象。&lt;/p&gt;
&lt;p&gt;在这种情况下，如何调用&lt;code&gt;Base&lt;/code&gt;类的成员呢，显然直接调用是不行的，得指明所属的类。&lt;/p&gt;
&lt;pre&gt;&lt;code&gt;Sub sub = new Sub;

sub-&amp;gt;otherA::iptr = nullptr;
sub-&amp;gt;otherB::iptr = nullptr;

sub-&amp;gt;iptr = nullptr; // 错误，会产生二义性问题
&lt;/code&gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;为了便于问题分析，我对类的布局调整了一下，确保字节对齐只在&lt;code&gt;Sub&lt;/code&gt;类中存在，在&lt;code&gt;Sub&lt;/code&gt;类中，&lt;code&gt;int a&lt;/code&gt;占有8个字节单位（后面4字节作为padding）。
&lt;code&gt;class&lt;/code&gt;的字节对齐原则和&lt;code&gt;struct&lt;/code&gt;字节对齐原则相同，参考文章&lt;a href=&quot;./%E4%B8%80%E6%AC%A1%E8%AE%B2%E6%B8%85%E6%A5%9A%E7%BB%93%E6%9E%84%E4%BD%93%E5%A4%A7%E5%B0%8F%E7%9A%84%E8%AE%A1%E7%AE%97.md&quot;&gt;一次讲清楚结构体大小的计算 - 吴奇灵的博客 (wqlblog.cn)&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;虚继承下的菱形继承&lt;/h2&gt;
&lt;pre&gt;&lt;code&gt;#include &amp;lt;iostream&amp;gt;
using namespace std;

class Base {
   public:
   int *iptr;
   char *cptr;
    virtual ~Base() = default;
};//  24 bytes

class otherA :  virtual public Base {
   public:
   char *cptr;
    otherA() = default;
}; // 40 bytes

class otherB :  virtual public Base {
   public:
    otherB() = default;
}; // 32 bytes

class Sub : public otherA, public otherB {
   public:
   int a;
    Sub() = default;
}; // 56 bytes

int main() {
    Sub sub;
    cout &amp;lt;&amp;lt; sizeof(Base) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(otherA) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(otherB) &amp;lt;&amp;lt; endl;
    cout &amp;lt;&amp;lt; sizeof(sub) &amp;lt;&amp;lt; endl;
    return 0;
}
&lt;/code&gt;&lt;/pre&gt;
&lt;pre&gt;&lt;code&gt;*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int * iptr
        16 |   char * cptr
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherA
         0 |   (otherA vtable pointer)
         8 |   char * cptr
        16 |   class Base (virtual base)
        16 |     (Base vtable pointer)
        24 |     int * iptr
        32 |     char * cptr
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class otherB
         0 |   (otherB vtable pointer)
         8 |   class Base (virtual base)
         8 |     (Base vtable pointer)
        16 |     int * iptr
        24 |     char * cptr
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Sub
         0 |   class otherA (primary base)
         0 |     (otherA vtable pointer)
         8 |     char * cptr
        16 |   class otherB (base)
        16 |     (otherB vtable pointer)
        24 |   int a
        32 |   class Base (virtual base)
        32 |     (Base vtable pointer)
        40 |     int * iptr
        48 |     char * cptr
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=28, nvalign=8]
&lt;/code&gt;&lt;/pre&gt;
&lt;p&gt;可以看出&lt;code&gt;otherA&lt;/code&gt;与&lt;code&gt;otherB&lt;/code&gt;类中，会生成独立的虚表指针，用于指向自己的虚函数表，并没有使用基类的虚表指针。&lt;/p&gt;
&lt;p&gt;而在&lt;code&gt;Sub&lt;/code&gt;类的布局中，&lt;code&gt;otherA，otherB&lt;/code&gt;中没有&lt;code&gt;Base&lt;/code&gt;类的类布局，而是将&lt;code&gt;Base&lt;/code&gt;类的类布局放到了末位，因为关键字&lt;code&gt; class Base (virtual base)&lt;/code&gt;，指明了&lt;code&gt;Base&lt;/code&gt;类是虚继承，因此之后根据该布局创建对象时，由于只有一个&lt;code&gt;Base&lt;/code&gt;类布局，所以只会创建一个&lt;code&gt;Base&lt;/code&gt;实例。&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;细心的朋友可能会发现，&lt;code&gt;Base&lt;/code&gt;类在类布局的末位，而不在一开始，这是为什么呢？&lt;/p&gt;
&lt;p&gt;两个原因：&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;如果放在开始，放在那个派生类的前面合适？例如有两个派生类继承&lt;code&gt;Base&lt;/code&gt;类，你放在第一个类之前，还是放在第二个类之前？同时，如果在菱形继承的基础上在嵌套一层菱形继承，那么&lt;code&gt;Base&lt;/code&gt;类应该放在哪里，才能确保所有的类都能访问到？&lt;/li&gt;
&lt;li&gt;为了保证动态访问，虚基类实例的访问使用虚基类指针（&lt;code&gt;vbptr&lt;/code&gt;）来动态访问，这种设计让类的布局更加灵活。&lt;/li&gt;
