
<span class="line" data-line="33"><span style="color:#24292E;--shiki-dark:#E1E4E8">    cout </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#D73A49;--shiki-dark:#F97583"> sizeof</span><span style="color:#24292E;--shiki-dark:#E1E4E8">(sub) </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> endl;</span></span>
<span class="line" data-line="34"><span style="color:#D73A49;--shiki-dark:#F97583">    return</span><span style="color:#005CC5;--shiki-dark:#79B8FF"> 0</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="35"><span style="color:#24292E;--shiki-dark:#E1E4E8">}</span></span></code></pre></div>
<p>使用<code>clang</code>查看类对象布局：</p>
<div class="not-prose code-wrapper"><pre class="astro-code astro-code-themes github-light github-dark" style="background-color:#fff;--shiki-dark-bg:#24292e;color:#24292e;--shiki-dark:#e1e4e8; overflow-x: auto;" tabindex="0" data-language="cpp"><code><span class="line" data-line="1"><span style="color:#24292E;--shiki-dark:#E1E4E8">clang</span><span style="color:#D73A49;--shiki-dark:#F97583">++</span><span style="color:#D73A49;--shiki-dark:#F97583"> -</span><span style="color:#24292E;--shiki-dark:#E1E4E8">Xclang </span><span style="color:#D73A49;--shiki-dark:#F97583">-</span><span style="color:#24292E;--shiki-dark:#E1E4E8">fdump</span><span style="color:#D73A49;--shiki-dark:#F97583">-</span><span style="color:#24292E;--shiki-dark:#E1E4E8">record</span><span style="color:#D73A49;--shiki-dark:#F97583">-</span><span style="color:#24292E;--shiki-dark:#E1E4E8">layouts Untitled</span><span style="color:#D73A49;--shiki-dark:#F97583">-</span><span style="color:#005CC5;--shiki-dark:#79B8FF">1.</span><span style="color:#D73A49;--shiki-dark:#F97583">cpp</span><span style="color:#D73A49;--shiki-dark:#F97583"> ></span><span style="color:#24292E;--shiki-dark:#E1E4E8"> classlayout</span></span></code></pre></div>
<div class="not-prose code-wrapper"><pre class="astro-code astro-code-themes github-light github-dark" style="background-color:#fff;--shiki-dark-bg:#24292e;color:#24292e;--shiki-dark:#e1e4e8; overflow-x: auto;" tabindex="0" data-language="cpp"><code><span class="line" data-line="1"><span style="color:#D73A49;--shiki-dark:#F97583">***</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> Dumping AST Record Layout</span></span>
<span class="line" data-line="2"><span style="color:#005CC5;--shiki-dark:#79B8FF">         0</span><span style="color:#D73A49;--shiki-dark:#F97583"> |</span><span style="color:#D73A49;--shiki-dark:#F97583"> class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Base</span></span>
<span class="line" data-line="3"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   (Base vtable pointer)</span></span>
<span class="line" data-line="4"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |   int * iptr</span></span>
<span class="line" data-line="5"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |   char * cptr</span></span>
<span class="line" data-line="6"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="7"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="8"></span>
<span class="line" data-line="9"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="10"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class otherA</span></span>
<span class="line" data-line="11"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   class Base (primary base)</span></span>
<span class="line" data-line="12"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |     (Base vtable pointer)</span></span>
<span class="line" data-line="13"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |     int * iptr</span></span>
<span class="line" data-line="14"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |     char * cptr</span></span>
<span class="line" data-line="15"><span style="color:#24292E;--shiki-dark:#E1E4E8">        24 |   char * cptr</span></span>
<span class="line" data-line="16"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=32, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=32, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="17"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=32, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="18"></span>
<span class="line" data-line="19"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="20"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class otherB</span></span>
<span class="line" data-line="21"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   class Base (primary base)</span></span>
<span class="line" data-line="22"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |     (Base vtable pointer)</span></span>
<span class="line" data-line="23"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |     int * iptr</span></span>
<span class="line" data-line="24"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |     char * cptr</span></span>
<span class="line" data-line="25"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="26"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="27"></span>
<span class="line" data-line="28"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="29"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class Sub</span></span>
<span class="line" data-line="30"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   class otherA (primary base)</span></span>
<span class="line" data-line="31"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |     class Base (primary base)</span></span>
<span class="line" data-line="32"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |       (Base vtable pointer)</span></span>
<span class="line" data-line="33"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |       int * iptr</span></span>
<span class="line" data-line="34"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |       char * cptr</span></span>
<span class="line" data-line="35"><span style="color:#24292E;--shiki-dark:#E1E4E8">        24 |     char * cptr</span></span>
<span class="line" data-line="36"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |   class otherB (base)</span></span>
<span class="line" data-line="37"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |     class Base (primary base)</span></span>
<span class="line" data-line="38"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |       (Base vtable pointer)</span></span>
<span class="line" data-line="39"><span style="color:#24292E;--shiki-dark:#E1E4E8">        40 |       int * iptr</span></span>
<span class="line" data-line="40"><span style="color:#24292E;--shiki-dark:#E1E4E8">        48 |       char * cptr</span></span>
<span class="line" data-line="41"><span style="color:#24292E;--shiki-dark:#E1E4E8">        56 |   int a</span></span>
<span class="line" data-line="42"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=64, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=60, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="43"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=60, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span></code></pre></div>
<p>在这种继承方式下，可以看到，<code>otherA</code>重新利用了基类的虚表指针，也就是一般继承方式下，<code>otherA</code>不会生成自己的虚表指针，但是需要注意的是，可能会修改该虚表指针指向的位置，因为在<code>otherA</code>类中可能重写了基类的函数，一般情况下虚表和虚表指针的变化，参考<a href="./C++%E8%99%9A%E5%87%BD%E6%95%B0%E8%A1%A8%E5%BA%95%E5%B1%82%E7%BB%93%E6%9E%84.md">C++虚函数表底层结构</a></p>
<p>同理<code>otherB</code>类也是这样，因此当子类<code>Sub</code>继承<code>otherA 或 otherB</code>也会遵循这种规则，即首先构造<code>otherA</code>，在构造<code>otherB</code>，而在<code>otherA</code>和<code>otherB</code>中又会首先构造<code>Base</code>，最终得到的<code>Sub</code>类对象，也会存在两个基类对象。</p>
<p>在这种情况下，如何调用<code>Base</code>类的成员呢，显然直接调用是不行的，得指明所属的类。</p>
<div class="not-prose code-wrapper"><pre class="astro-code astro-code-themes github-light github-dark" style="background-color:#fff;--shiki-dark-bg:#24292e;color:#24292e;--shiki-dark:#e1e4e8; overflow-x: auto;" tabindex="0" data-language="cpp"><code><span class="line" data-line="1"><span style="color:#24292E;--shiki-dark:#E1E4E8">Sub sub </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#D73A49;--shiki-dark:#F97583"> new</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> Sub;</span></span>
<span class="line" data-line="2"></span>
<span class="line" data-line="3"><span style="color:#24292E;--shiki-dark:#E1E4E8">sub->otherA::iptr </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#005CC5;--shiki-dark:#79B8FF"> nullptr</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="4"><span style="color:#24292E;--shiki-dark:#E1E4E8">sub->otherB::iptr </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#005CC5;--shiki-dark:#79B8FF"> nullptr</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="5"></span>
<span class="line" data-line="6"><span style="color:#24292E;--shiki-dark:#E1E4E8">sub->iptr </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#005CC5;--shiki-dark:#79B8FF"> nullptr</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span><span style="color:#6A737D;--shiki-dark:#6A737D"> // 错误，会产生二义性问题</span></span></code></pre></div>
<blockquote>
<p>为了便于问题分析，我对类的布局调整了一下，确保字节对齐只在<code>Sub</code>类中存在，在<code>Sub</code>类中，<code>int a</code>占有8个字节单位（后面4字节作为padding）。
<code>class</code>的字节对齐原则和<code>struct</code>字节对齐原则相同，参考文章<a href="./%E4%B8%80%E6%AC%A1%E8%AE%B2%E6%B8%85%E6%A5%9A%E7%BB%93%E6%9E%84%E4%BD%93%E5%A4%A7%E5%B0%8F%E7%9A%84%E8%AE%A1%E7%AE%97.md">一次讲清楚结构体大小的计算</a></p>
</blockquote>
<h2 id="虚继承下的菱形继承"><a href="#虚继承下的菱形继承">虚继承下的菱形继承</a><a href="#虚继承下的菱形继承" class="heading-anchor-link" aria-label="复制标题链接" data-heading-id="虚继承下的菱形继承"><svg viewBox="0 0 24 24" width="14" height="14" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" class="heading-anchor-icon heading-anchor-icon--link"><path d="M10 13a5 5 0 0 0 7.54.54l3-3a5 5 0 0 0-7.07-7.07l-1.72 1.71"></path><path d="M14 11a5 5 0 0 0-7.54-.54l-3 3a5 5 0 0 0 7.07 7.07l1.71-1.71"></path></svg><svg viewBox="0 0 24 24" width="14" height="14" fill="none" stroke="currentColor" stroke-width="2.5" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" class="heading-anchor-icon heading-anchor-icon--check"><polyline points="20 6 9 17 4 12"></polyline></svg></a></h2>
<div class="not-prose code-wrapper"><pre class="astro-code astro-code-themes github-light github-dark" style="background-color:#fff;--shiki-dark-bg:#24292e;color:#24292e;--shiki-dark:#e1e4e8; overflow-x: auto;" tabindex="0" data-language="cpp"><code><span class="line" data-line="1"><span style="color:#D73A49;--shiki-dark:#F97583">#include</span><span style="color:#032F62;--shiki-dark:#9ECBFF"> &#x3C;iostream></span></span>
<span class="line" data-line="2"><span style="color:#D73A49;--shiki-dark:#F97583">using</span><span style="color:#D73A49;--shiki-dark:#F97583"> namespace</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> std</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="3"></span>
<span class="line" data-line="4"><span style="color:#D73A49;--shiki-dark:#F97583">class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Base</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> {</span></span>
<span class="line" data-line="5"><span style="color:#D73A49;--shiki-dark:#F97583">   public:</span></span>
<span class="line" data-line="6"><span style="color:#D73A49;--shiki-dark:#F97583">   int</span><span style="color:#D73A49;--shiki-dark:#F97583"> *</span><span style="color:#24292E;--shiki-dark:#E1E4E8">iptr;</span></span>
<span class="line" data-line="7"><span style="color:#D73A49;--shiki-dark:#F97583">   char</span><span style="color:#D73A49;--shiki-dark:#F97583"> *</span><span style="color:#24292E;--shiki-dark:#E1E4E8">cptr;</span></span>
<span class="line" data-line="8"><span style="color:#D73A49;--shiki-dark:#F97583">    virtual</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> ~Base</span><span style="color:#24292E;--shiki-dark:#E1E4E8">() </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#D73A49;--shiki-dark:#F97583"> default</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="9"><span style="color:#24292E;--shiki-dark:#E1E4E8">};</span><span style="color:#6A737D;--shiki-dark:#6A737D">//  24 bytes</span></span>
<span class="line" data-line="10"></span>
<span class="line" data-line="11"><span style="color:#D73A49;--shiki-dark:#F97583">class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> otherA</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> :  </span><span style="color:#D73A49;--shiki-dark:#F97583">virtual</span><span style="color:#D73A49;--shiki-dark:#F97583"> public</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Base</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> {</span></span>
<span class="line" data-line="12"><span style="color:#D73A49;--shiki-dark:#F97583">   public:</span></span>
<span class="line" data-line="13"><span style="color:#D73A49;--shiki-dark:#F97583">   char</span><span style="color:#D73A49;--shiki-dark:#F97583"> *</span><span style="color:#24292E;--shiki-dark:#E1E4E8">cptr;</span></span>
<span class="line" data-line="14"><span style="color:#6F42C1;--shiki-dark:#B392F0">    otherA</span><span style="color:#24292E;--shiki-dark:#E1E4E8">() </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#D73A49;--shiki-dark:#F97583"> default</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="15"><span style="color:#24292E;--shiki-dark:#E1E4E8">};</span><span style="color:#6A737D;--shiki-dark:#6A737D"> // 40 bytes</span></span>
<span class="line" data-line="16"></span>
<span class="line" data-line="17"><span style="color:#D73A49;--shiki-dark:#F97583">class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> otherB</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> :  </span><span style="color:#D73A49;--shiki-dark:#F97583">virtual</span><span style="color:#D73A49;--shiki-dark:#F97583"> public</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Base</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> {</span></span>
<span class="line" data-line="18"><span style="color:#D73A49;--shiki-dark:#F97583">   public:</span></span>
<span class="line" data-line="19"><span style="color:#6F42C1;--shiki-dark:#B392F0">    otherB</span><span style="color:#24292E;--shiki-dark:#E1E4E8">() </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#D73A49;--shiki-dark:#F97583"> default</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="20"><span style="color:#24292E;--shiki-dark:#E1E4E8">};</span><span style="color:#6A737D;--shiki-dark:#6A737D"> // 32 bytes</span></span>
<span class="line" data-line="21"></span>
<span class="line" data-line="22"><span style="color:#D73A49;--shiki-dark:#F97583">class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Sub</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> : </span><span style="color:#D73A49;--shiki-dark:#F97583">public</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> otherA</span><span style="color:#24292E;--shiki-dark:#E1E4E8">, </span><span style="color:#D73A49;--shiki-dark:#F97583">public</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> otherB</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> {</span></span>
<span class="line" data-line="23"><span style="color:#D73A49;--shiki-dark:#F97583">   public:</span></span>
<span class="line" data-line="24"><span style="color:#D73A49;--shiki-dark:#F97583">   int</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> a;</span></span>
<span class="line" data-line="25"><span style="color:#6F42C1;--shiki-dark:#B392F0">    Sub</span><span style="color:#24292E;--shiki-dark:#E1E4E8">() </span><span style="color:#D73A49;--shiki-dark:#F97583">=</span><span style="color:#D73A49;--shiki-dark:#F97583"> default</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="26"><span style="color:#24292E;--shiki-dark:#E1E4E8">};</span><span style="color:#6A737D;--shiki-dark:#6A737D"> // 56 bytes</span></span>
<span class="line" data-line="27"></span>
<span class="line" data-line="28"><span style="color:#D73A49;--shiki-dark:#F97583">int</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> main</span><span style="color:#24292E;--shiki-dark:#E1E4E8">() {</span></span>
<span class="line" data-line="29"><span style="color:#24292E;--shiki-dark:#E1E4E8">    Sub sub;</span></span>
<span class="line" data-line="30"><span style="color:#24292E;--shiki-dark:#E1E4E8">    cout </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#D73A49;--shiki-dark:#F97583"> sizeof</span><span style="color:#24292E;--shiki-dark:#E1E4E8">(Base) </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> endl;</span></span>
<span class="line" data-line="31"><span style="color:#24292E;--shiki-dark:#E1E4E8">    cout </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#D73A49;--shiki-dark:#F97583"> sizeof</span><span style="color:#24292E;--shiki-dark:#E1E4E8">(otherA) </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> endl;</span></span>
<span class="line" data-line="32"><span style="color:#24292E;--shiki-dark:#E1E4E8">    cout </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#D73A49;--shiki-dark:#F97583"> sizeof</span><span style="color:#24292E;--shiki-dark:#E1E4E8">(otherB) </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> endl;</span></span>
<span class="line" data-line="33"><span style="color:#24292E;--shiki-dark:#E1E4E8">    cout </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#D73A49;--shiki-dark:#F97583"> sizeof</span><span style="color:#24292E;--shiki-dark:#E1E4E8">(sub) </span><span style="color:#D73A49;--shiki-dark:#F97583">&#x3C;&#x3C;</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> endl;</span></span>
<span class="line" data-line="34"><span style="color:#D73A49;--shiki-dark:#F97583">    return</span><span style="color:#005CC5;--shiki-dark:#79B8FF"> 0</span><span style="color:#24292E;--shiki-dark:#E1E4E8">;</span></span>
<span class="line" data-line="35"><span style="color:#24292E;--shiki-dark:#E1E4E8">}</span></span></code></pre></div>
<div class="not-prose code-wrapper"><pre class="astro-code astro-code-themes github-light github-dark" style="background-color:#fff;--shiki-dark-bg:#24292e;color:#24292e;--shiki-dark:#e1e4e8; overflow-x: auto;" tabindex="0" data-language="cpp"><code><span class="line" data-line="1"><span style="color:#D73A49;--shiki-dark:#F97583">***</span><span style="color:#24292E;--shiki-dark:#E1E4E8"> Dumping AST Record Layout</span></span>
<span class="line" data-line="2"><span style="color:#005CC5;--shiki-dark:#79B8FF">         0</span><span style="color:#D73A49;--shiki-dark:#F97583"> |</span><span style="color:#D73A49;--shiki-dark:#F97583"> class</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> Base</span></span>
<span class="line" data-line="3"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   (Base vtable pointer)</span></span>
<span class="line" data-line="4"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |   int * iptr</span></span>
<span class="line" data-line="5"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |   char * cptr</span></span>
<span class="line" data-line="6"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="7"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=24, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="8"></span>
<span class="line" data-line="9"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="10"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class otherA</span></span>
<span class="line" data-line="11"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   (otherA vtable pointer)</span></span>
<span class="line" data-line="12"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |   char * cptr</span></span>
<span class="line" data-line="13"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |   class Base (</span><span style="color:#D73A49;--shiki-dark:#F97583">virtual</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> base</span><span style="color:#24292E;--shiki-dark:#E1E4E8">)</span></span>
<span class="line" data-line="14"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |     (Base vtable pointer)</span></span>
<span class="line" data-line="15"><span style="color:#24292E;--shiki-dark:#E1E4E8">        24 |     int * iptr</span></span>
<span class="line" data-line="16"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |     char * cptr</span></span>
<span class="line" data-line="17"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=40, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=40, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="18"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=16, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="19"></span>
<span class="line" data-line="20"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="21"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class otherB</span></span>
<span class="line" data-line="22"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   (otherB vtable pointer)</span></span>
<span class="line" data-line="23"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |   class Base (</span><span style="color:#D73A49;--shiki-dark:#F97583">virtual</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> base</span><span style="color:#24292E;--shiki-dark:#E1E4E8">)</span></span>
<span class="line" data-line="24"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |     (Base vtable pointer)</span></span>
<span class="line" data-line="25"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |     int * iptr</span></span>
<span class="line" data-line="26"><span style="color:#24292E;--shiki-dark:#E1E4E8">        24 |     char * cptr</span></span>
<span class="line" data-line="27"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=32, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=32, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="28"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=8, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span>
<span class="line" data-line="29"></span>
<span class="line" data-line="30"><span style="color:#24292E;--shiki-dark:#E1E4E8">*** Dumping AST Record Layout</span></span>
<span class="line" data-line="31"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 | class Sub</span></span>
<span class="line" data-line="32"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |   class otherA (primary base)</span></span>
<span class="line" data-line="33"><span style="color:#24292E;--shiki-dark:#E1E4E8">         0 |     (otherA vtable pointer)</span></span>
<span class="line" data-line="34"><span style="color:#24292E;--shiki-dark:#E1E4E8">         8 |     char * cptr</span></span>
<span class="line" data-line="35"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |   class otherB (base)</span></span>
<span class="line" data-line="36"><span style="color:#24292E;--shiki-dark:#E1E4E8">        16 |     (otherB vtable pointer)</span></span>
<span class="line" data-line="37"><span style="color:#24292E;--shiki-dark:#E1E4E8">        24 |   int a</span></span>
<span class="line" data-line="38"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |   class Base (</span><span style="color:#D73A49;--shiki-dark:#F97583">virtual</span><span style="color:#6F42C1;--shiki-dark:#B392F0"> base</span><span style="color:#24292E;--shiki-dark:#E1E4E8">)</span></span>
<span class="line" data-line="39"><span style="color:#24292E;--shiki-dark:#E1E4E8">        32 |     (Base vtable pointer)</span></span>
<span class="line" data-line="40"><span style="color:#24292E;--shiki-dark:#E1E4E8">        40 |     int * iptr</span></span>
<span class="line" data-line="41"><span style="color:#24292E;--shiki-dark:#E1E4E8">        48 |     char * cptr</span></span>
<span class="line" data-line="42"><span style="color:#24292E;--shiki-dark:#E1E4E8">           | [sizeof=56, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">dsize</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=56, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">align</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8,</span></span>
<span class="line" data-line="43"><span style="color:#24292E;--shiki-dark:#E1E4E8">           |  nvsize=28, </span><span style="color:#6F42C1;--shiki-dark:#B392F0">nvalign</span><span style="color:#24292E;--shiki-dark:#E1E4E8">=8]</span></span></code></pre></div>
<p>可以看出<code>otherA</code>与<code>otherB</code>类中，会生成独立的虚表指针，用于指向自己的虚函数表，并没有使用基类的虚表指针。</p>
<p>而在<code>Sub</code>类的布局中，<code>otherA，otherB</code>中没有<code>Base</code>类的类布局，而是将<code>Base</code>类的类布局放到了末位，因为关键字<code> class Base (virtual base)</code>，指明了<code>Base</code>类是虚继承，因此之后根据该布局创建对象时，由于只有一个<code>Base</code>类布局，所以只会创建一个<code>Base</code>实例。</p>
<blockquote>
<p>细心的朋友可能会发现，<code>Base</code>类在类布局的末位，而不在一开始，这是为什么呢？</p>
<p>两个原因：</p>
<ul>
